<a href="https://colab.research.google.com/github/Malina66/pr_06.03/blob/main/06_03_2021_paktica.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np
from IPython.display import display

# data import

In [2]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data")
data.head(3)

   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.00.1  1.1
0  2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83   0.0     0.0    1
1  3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78   0.0     0.0    1
2  4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22   0.0     0.0    1

In [4]:
names = ["id","RI","Na", "Mg", "Ai", "Si", "K", "Ca","Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['id'])
data.head(3)

        RI     Na    Mg    Ai     Si     K    Ca   Ba   Fe  Class
0  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
1  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1
2  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0      1

In [11]:
data['Class'].replace (
    {
        1:"building_float",
        2:"building_non_float",
        3:"vehicle_float",
        4:"vehicle_non_float",
        5:"containers",
        6:"tableware",
        7:"headlamps"
    }, inplace = True
)
data.head(3)

        RI     Na    Mg    Ai     Si     K    Ca   Ba   Fe           Class
0  1.51761  13.89  3.60  1.36  72.73   NaN  7.83  NaN  0.0  building_float
1      NaN  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0  building_float
2  1.51766  13.21  3.69   NaN    NaN  0.57  8.22  0.0  0.0             NaN

In [17]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index,col] = np.nan
data.head()

        RI     Na    Mg    Ai     Si     K    Ca   Ba   Fe           Class
0  1.51761  13.89  3.60  1.36  72.73   NaN  7.83  NaN  0.0  building_float
1      NaN  13.53  3.55  1.54    NaN  0.39  7.78  NaN  0.0  building_float
2      NaN  13.21  3.69   NaN    NaN  0.57   NaN  NaN  0.0             NaN
3  1.51742  13.27   NaN   NaN  73.08  0.55  8.07  NaN  0.0             NaN
4      NaN    NaN   NaN  1.62  72.97  0.64  8.07  0.0  NaN  building_float

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 213 entries, 0 to 212
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      116 non-null    float64
 1   Na      114 non-null    float64
 2   Mg      108 non-null    float64
 3   Ai      101 non-null    float64
 4   Si      112 non-null    float64
 5   K       108 non-null    float64
 6   Ca      106 non-null    float64
 7   Ba      113 non-null    float64
 8   Fe      116 non-null    float64
 9   Class   114 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [19]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  116.000000  114.000000  108.000000  ...  106.000000  113.000000  116.000000
mean     1.518081   13.476667    2.533704  ...    8.916981    0.153451    0.064138
std      0.002704    0.836979    1.493589  ...    1.502020    0.468321    0.106306
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516460   12.982500    1.460000  ...    8.155000    0.000000    0.000000
50%      1.517685   13.280000    3.455000  ...    8.545000    0.000000    0.000000
75%      1.519012   14.007500    3.580000  ...    9.147500    0.000000    0.112500
max      1.527770   17.380000    3.980000  ...   14.960000    2.880000    0.510000

[8 rows x 9 columns]

In [22]:
display(data['Class'].describe())
print ("*****************************")
display(data['Class'].value_counts())

count                    114
unique                     6
top       building_non_float
freq                      42
Name: Class, dtype: object

*****************************

building_non_float    42
building_float        36
headlamps             14
vehicle_float         11
containers             6
tableware              5
Name: Class, dtype: int64